
Interestingly, I've just tried specifying an owner for the Service Principal, but TF seems to have failed to add it.

``` Terraform
...
# Retrieve domain information
data "azuread_domains" "example" {
  only_initial = true
}

# Bug fix
data "azuread_client_config" "current" {}

# Create an application
resource "azuread_application" "example" {
  display_name = "ExampleApp"
  owners       = [data.azuread_client_config.current.object_id]
}

# Create a service principal
resource "azuread_service_principal" "example" {
  application_id = azuread_application.example.application_id
  owners         = [data.azuread_client_config.current.object_id]
}
...
```

``` Terraform
Terraform will perform the following actions:

  # azuread_application.example will be created
  + resource "azuread_application" "example" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "ExampleApp"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "REDACTED_OBJECT_ID_1",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
    }

  # azuread_service_principal.example will be created
  + resource "azuread_service_principal" "example" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "REDACTED_OBJECT_ID_1",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + type                        = (known after apply)
    }
...
```

``` terraform
...
azuread_application.example: Creating...
...
azuread_application.example: Creation complete after 1s [id=ac10ac2f-5125-4ee0-8486-432ccc4dbbd2]        
azuread_service_principal.example: Creating...
azuread_service_principal.example: Creation complete after 0s [id=69aae805-7294-4a46-88ba-f31fd7953c45]  
```

The application is given an owner, but the service principal is not:

``` PowerShell
PS > Get-AzureADApplicationOwner -ObjectID ac10ac2f-5125-4ee0-8486-432ccc4dbbd2

ObjectId                             DisplayName  UserPrincipalName                                               UserT
                                                                                                                  ype
--------                             -----------  -----------------                                               -----
REDACTED_OBJECT_ID_1 Graeme Meyer REDACTED.com#EXT#@REDACTED.onmicrosoft.com Me...


PS > Get-AzureADServicePrincipalOwner -ObjectId 69aae805-7294-4a46-88ba-f31fd7953c45
PS > 
```
